segment readable executable
    entry $        ; точка входу

    ; введення символів з клавіатури
    mov eax, 3     ; системний виклик для зчитування зі стандартного вводу
    mov ebx, 0     ; файловий дескриптор стандартного вводу (stdin)
    mov ecx, buffer ; адреса буфера для збереження введених символів
    mov edx, 10    ; кількість байт, яку слід зчитати
    int 0x80        ; виклик системи

    ; виведення введених символів на екран
    mov eax, 4     ; системний виклик для запису в стандартний вивід
    mov ebx, 1     ; файловий дескриптор стандартного виводу (stdout)
    mov ecx, buffer ; адреса буфера для виводу
    mov edx, 10    ; кількість байт для виводу
    int 0x80       ; виклик системи

    ; відкриття файлу для запису
    mov eax, 5     ; системний виклик для відкриття файлу
    mov ebx, filename ; адреса рядка з ім'ям файлу
    mov ecx, 01001     ; O_CREAT | O_WRONLY
    mov edx, 0777     ; права доступу файлу
    int 0x80        ; виклик системи

    ; запис вмісту буфера у файл
    mov edx, 10    ; кількість байт для запису
    mov ecx, buffer ; адреса буфера для запису
    mov ebx, eax   ; файловий дескриптор, отриманий при відкритті
    mov eax, 4     ; системний виклик для запису в файл
    int 0x80        ; виклик системи

    ; закриття файлу
    mov eax, 6     ; системний виклик для закриття файлу
    mov ebx, eax     ; файловий дескриптордля закриття
    int 0x80        ; виклик системи

    ; вихід з програми
    mov eax, 1     ; системний виклик для завершення програми exit
    xor ebx, ebx   ; код завершення 0
    int 0x80        ; виклик системи

segment readable writeable
    buffer db 10   ; буфер для збереження введених символів

segment readable
    filename db "output.txt", 0 ; ім'я файлу 
