format ELF executable
segment readable executable
    entry $        ; точка входу

    ; відкриття файлу для зчитування
    mov eax, 5     ; системний виклик для відкриття файлу
    mov ebx, filename ; адреса рядка з ім'ям файлу
    mov ecx, 0     ; режим доступу (read-only)
    mov edx, 0777; права доступу
    int 0x80        ; виклик системи

    ; зчитати файл
    mov edx, 10    ; кількість байт для запису
    mov ecx, buffer ; адреса буфера для запису
    mov ebx, eax   ; файловий дескриптор, отриманий при відкритті
    mov eax, 3     ; системний виклик для запису в файл
    int 0x80        ; виклик системи

    ; закриття файлу
    mov eax, 6     ; системний виклик для закриття файлу
    mov ebx, eax     ; файловий дескриптор для закриття
    int 0x80        ; виклик системи

    ; виведення зчитаних символів на екран
    mov eax, 4     ; системний виклик для запису в стандартний вивід
    mov ebx, 1     ; файловий дескриптор стандартного виводу (stdout)
    mov ecx, buffer ; адреса буфера для виводу
    mov edx, 10    ; кількість байт для виводу
    int 0x80       ; виклик системи

    ; відкриття файлу для запису
    mov eax, 8     ; системний виклик для відкриття файлу
    mov ebx, filename2 ; адреса рядка з ім'ям файлу
    mov ecx, 0777     ; права доступу
    int 0x80        ; виклик системи

    ; запис вмісту буфера у файл
    mov edx, 10    ; кількість байт для запису
    mov ecx, buffer ; адреса буфера для запису
    mov ebx, eax   ; файловий дескриптор, отриманий при відкритті
    mov eax, 4     ; системний виклик для запису в файл
    int 0x80        ; виклик системи

    ; закриття файлу
    mov eax, 6     ; системний виклик для закриття файлу
    mov ebx, eax     ; файловий дескриптор для закриття
    int 0x80        ; виклик системи

    ; вихід з програми
    mov eax, 1     ; системний виклик для завершення програми exit
    xor ebx, ebx   ; код завершення 0
    int 0x80        ; виклик системи

segment readable writeable
    buffer db 10   ; буфер для збереження введених символів

segment readable
    filename db "output.txt", 0 ; ім'я першого файлу з символами
    filename2 db "output2.txt", 0; ім'я другого файлу в який необхідно записати символи з першого файлу

