% Правило для вилучення елементу X зі списку [X|Tail], де X перший елемент списку.
remove(X, [X|Tail], Tail).
% Це правило говорить, 
% що якщо X - перший елемент списку [X|Tail], то результат вилучення X зі списку буде Tail.

% Правило для вилучення елементу X зі списку [Head|Tail], де X не перший елемент списку.
remove(X, [Head|Tail], [Head|Result]) :-
    remove(X, Tail, Result).

% Це правило виконується, коли X не є першим елементом списку. 
% Воно говорить, що результат вилучення X зі списку [Head|Tail] буде список, 
в якому Head залишається на своєму місці, а результат вилучення X зі списку Tail буде Result.